Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_sgpio_type.h
/**************************************************************************//**
 * @defgroup SGPIO_MULDATA_DP
 * @brief  Multiple Data Duplicate Register          (@ 0X06C)
 * @{
 *****************************************************************************/
#define SGPIO_SHIFT_MULDATA_DP                       0
#define SGPIO_MASK_MULDATA_DP                        ((u32)0xFFFFFFFF << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SGPIO_MULPOSR
 * @brief  Multiple Position Register                (@ 0X070)
 * @{
 *****************************************************************************/
#define SGPIO_SHIFT_MULPOSRST                        8
#define SGPIO_MASK_MULPOSRST                         ((u32)0x0000001F << 8)                              /*!<R/W 0   */
#define SGPIO_SHIFT_MULPOSTC                         0
#define SGPIO_MASK_MULPOSTC                          ((u32)0x0000001F << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SGPIO_MULFDATA
 * @brief  Multiple FIFO Data Register               (@ 0X074)
 * @{
 *****************************************************************************/
#define SGPIO_SHIFT_MULFDATA                         0
#define SGPIO_MASK_MULFDATA                          ((u32)0xFFFFFFFF << 0)                              /*!<W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SGPIO_IS
 * @brief  SGPIO Interrupt Status Register           (@ 0X078)
 * @{
 *****************************************************************************/
#define SGPIO_SHIFT_MUL_DMA_UNFL_IS                  11
#define SGPIO_BIT_MUL_DMA_UNFL_IS                    ((u32)0x00000001 << 11)                             /*!<R/W 0   */
#define SGPIO_SHIFT_MULMCNT_IS                       10
#define SGPIO_BIT_MULMCNT_IS                         ((u32)0x00000001 << 10)                             /*!<R/W 0   */
#define SGPIO_SHIFT_PATTERN_MATCH_IS                 9
#define SGPIO_BIT_PATTERN_MATCH_IS                   ((u32)0x00000001 << 9)                              /*!<R/W 0   */
#define SGPIO_SHIFT_MULLOAD_IS                       8
#define SGPIO_BIT_MULLOAD_IS                         ((u32)0x00000001 << 8)                              /*!<R/W 0   */
#define SGPIO_SHIFT_RXLOAD_IS                        7
#define SGPIO_BIT_RXLOAD_IS                          ((u32)0x00000001 << 7)                              /*!<R/W 0   */
#define SGPIO_SHIFT_MULSFT_IS                        6
#define SGPIO_BIT_MULSFT_IS                          ((u32)0x00000001 << 6)                              /*!<R/W 0   */
#define SGPIO_SHIFT_RXSFT_IS                         5
#define SGPIO_BIT_RXSFT_IS                           ((u32)0x00000001 << 5)                              /*!<R/W 0   */
#define SGPIO_SHIFT_CAPI_IS                          4
#define SGPIO_BIT_CAPI_IS                            ((u32)0x00000001 << 4)                              /*!<R/W 0   */
#define SGPIO_SHIFT_MUL_MR0I_IS                      3
#define SGPIO_BIT_MUL_MR0I_IS                        ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SGPIO_SHIFT_RX_MR2I_IS                       2
#define SGPIO_BIT_RX_MR2I_IS                         ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define SGPIO_SHIFT_RX_MR1I_IS                       1
#define SGPIO_BIT_RX_MR1I_IS                         ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SGPIO_SHIFT_RX_MR0I_IS                       0
#define SGPIO_BIT_RX_MR0I_IS                         ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SGPIO_GF
 * @brief  SGPIO Glitch Filter Register              (@ 0X07C)
 * @{
 *****************************************************************************/
#define SGPIO_SHIFT_GF                               0
#define SGPIO_MASK_GF                                ((u32)0x000000FF << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SGPIO_OUTPUT
 * @brief  SGPIO Output Register                     (@ 0X080)
 * @{
 *****************************************************************************/
#define SGPIO_SHIFT_OUTPUT                           0
#define SGPIO_BIT_OUTPUT                             ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup SGPIO_IM
 * @brief  SGPIO Interrupt Mask Register             (@ 0X084)
 * @{
 *****************************************************************************/
#define SGPIO_SHIFT_MUL_DMA_UNFL_IM                  11
#define SGPIO_BIT_MUL_DMA_UNFL_IM                    ((u32)0x00000001 << 11)                             /*!<R/W 0   */
#define SGPIO_SHIFT_MULMCNT_IM                       10
#define SGPIO_BIT_MULMCNT_IM                         ((u32)0x00000001 << 10)                             /*!<R/W 0   */
#define SGPIO_SHIFT_PATTERN_MATCH_IM                 9
#define SGPIO_BIT_PATTERN_MATCH_IM                   ((u32)0x00000001 << 9)                              /*!<R/W 0   */
#define SGPIO_SHIFT_MULLOAD_IM                       8
#define SGPIO_BIT_MULLOAD_IM                         ((u32)0x00000001 << 8)                              /*!<R/W 0   */
#define SGPIO_SHIFT_RXLOAD_IM                        7
#define SGPIO_BIT_RXLOAD_IM                          ((u32)0x00000001 << 7)                              /*!<R/W 0   */
#define SGPIO_SHIFT_MULSFT_IM                        6
#define SGPIO_BIT_MULSFT_IM                          ((u32)0x00000001 << 6)                              /*!<R/W 0   */
#define SGPIO_SHIFT_RXSFT_IM                         5
#define SGPIO_BIT_RXSFT_IM                           ((u32)0x00000001 << 5)                              /*!<R/W 0   */
#define SGPIO_SHIFT_CAPI_IM                          4
#define SGPIO_BIT_CAPI_IM                            ((u32)0x00000001 << 4)                              /*!<R/W 0   */
#define SGPIO_SHIFT_MUL_MR0I_IM                      3
#define SGPIO_BIT_MUL_MR0I_IM                        ((u32)0x00000001 << 3)                              /*!<R/W 0   */
#define SGPIO_SHIFT_RX_MR2I_IM                       2
#define SGPIO_BIT_RX_MR2I_IM                         ((u32)0x00000001 << 2)                              /*!<R/W 0   */
#define SGPIO_SHIFT_RX_MR1I_IM                       1
#define SGPIO_BIT_RX_MR1I_IM                         ((u32)0x00000001 << 1)                              /*!<R/W 0   */
#define SGPIO_SHIFT_RX_MR0I_IM                       0
#define SGPIO_BIT_RX_MR0I_IM                         ((u32)0x00000001 << 0)                              /*!<R/W 0   */
/** @} */

/**************************************************************************//**
 * @defgroup rtl8735b_SGPIO
 * @{
 * @brief rtl8735b_SGPIO Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t SGPIO_RXTMR_CTRL ;                       /*!<  RX Timer Control Register register,  Address offset: 0x000 */
	__IO uint32_t SGPIO_RXPRVAL ;                          /*!<  RX Maximum Prescale Register register,  Address offset: 0x004 */
	__IO uint32_t SGPIO_RXPRTC ;                           /*!<  RX Timer Prescale Register register,  Address offset: 0x008 */
	__IO uint32_t SGPIO_RXTC ;                             /*!<  RX Timer Counter Register register,  Address offset: 0x00C */
	__IO uint32_t SGPIO_RXMC ;                             /*!<  Position Counter Register register,  Address offset: 0x010 */
	__IO uint32_t SGPIO_RXMR0 ;                            /*!<  RX Match Register 0 register,  Address offset: 0x014 */
	__IO uint32_t SGPIO_RXMR1 ;                            /*!<  RX Match Register 1 register,  Address offset: 0x018 */
	__IO uint32_t SGPIO_RXMR2 ;                            /*!<  RX Match Register 2 register,  Address offset: 0x01C */
	__IO uint32_t SGPIO_CAP_CTRL ;                         /*!<  Capture Control Register register,  Address offset: 0x020 */
	__IO uint32_t SGPIO_CAPR ;                             /*!<  Capture Register register,  Address offset: 0x024 */
	__IO uint32_t SGPIO_MULTMR_CTRL ;                      /*!<  Multiple Timer Control Register register,  Address offset: 0x028 */
	__IO uint32_t SGPIO_MULPRVAL ;                         /*!<  Multiple Maximum Prescale Register register,  Address offset: 0x02C */
	__IO uint32_t SGPIO_MULPRTC ;                          /*!<  Multiple Timer Prescale Register register,  Address offset: 0x030 */
	__IO uint32_t SGPIO_MULTC ;                            /*!<  Multiple Timer Counter Register register,  Address offset: 0x034 */
	__IO uint32_t SGPIO_MULMC ;                            /*!<  Multiple Match Control Register register,  Address offset: 0x038 */
	__IO uint32_t SGPIO_MULMR01GP0 ;                       /*!<  Multiple Match Register 0 & 1 For Group 0 register,  Address offset: 0x03C */
	__IO uint32_t SGPIO_MULMR23GP0 ;                       /*!<  Multiple Match Register 2 & 3 For Group 0 register,  Address offset: 0x040 */
	__IO uint32_t SGPIO_MULMR01GP1 ;                       /*!<  Multiple Match Register 0 & 1 For Group 1 register,  Address offset: 0x044 */
	__IO uint32_t SGPIO_MULMR23GP1 ;                       /*!<  Multiple Match Register 2 & 3 For Group 1 register,  Address offset: 0x048 */
	__IO uint32_t SGPIO_MUL_MCNT ;                         /*!<  Multiple Match Counter Register register,  Address offset: 0x04C */
	__IO uint32_t SGPIO_MULEMR ;                           /*!<  External Match Control Register register,  Address offset: 0x050 */
	__IO uint32_t SGPIO_DATA_CTRL ;                        /*!<  Data Control Register register,  Address offset: 0x054 */
	__IO uint32_t SGPIO_RXDATA ;                           /*!<  RX Data Register register,  Address offset: 0x058 */
	__IO uint32_t SGPIO_RXDATA_DP ;                        /*!<  RX Data Duplicate Register register,  Address offset: 0x05C */
	__IO uint32_t SGPIO_RXPOSR ;                           /*!<  RX Position Register register,  Address offset: 0x060 */
	__IO uint32_t SGPIO_RXDATAMASK ;                       /*!<  RX Data Mask Register register,  Address offset: 0x064 */
	__IO uint32_t SGPIO_MULDATA ;                          /*!<  Multiple Data Register register,  Address offset: 0x068 */
	__IO uint32_t SGPIO_MULDATA_DP ;                       /*!<  Multiple Data Duplicate Register register,  Address offset: 0x06C */
	__IO uint32_t SGPIO_MULPOSR ;                          /*!<  Multiple Position Register register,  Address offset: 0x070 */
	__O  uint32_t SGPIO_MULFDATA ;                         /*!<  Multiple FIFO Data Register register,  Address offset: 0x074 */
	__IO uint32_t SGPIO_IS ;                               /*!<  SGPIO Interrupt Status Register register,  Address offset: 0x078 */
	__IO uint32_t SGPIO_GF ;                               /*!<  SGPIO Glitch Filter Register register,  Address offset: 0x07C */
	__IO uint32_t SGPIO_OUTPUT ;                           /*!<  SGPIO Output Register register,  Address offset: 0x080 */
	__IO uint32_t SGPIO_IM ;                               /*!<  SGPIO Interrupt Mask Register register,         Address offset: 0x084 */
} SGPIO_TypeDef;
/** @} */

#endif
